<a href="https://colab.research.google.com/github/sadullahmath/Exercise/blob/master/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Titanic

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.read_csv('https://raw.githubusercontent.com/PacktWorkshops/The-Supervised-Learning-Workshop/master/Chapter01/Datasets/titanic.csv')

In [3]:
df.head(10) # Examine the first 10 samples

   Unnamed: 0 Cabin Embarked     Fare  ...  Parch     Sex  SibSp Survived
0           0   NaN        S   7.2500  ...      0    male      1      0.0
1           1   C85        C  71.2833  ...      0  female      1      1.0
2           2   NaN        S   7.9250  ...      0  female      0      1.0
3           3  C123        S  53.1000  ...      0  female      1      1.0
4           4   NaN        S   8.0500  ...      0    male      0      0.0
5           5   NaN        Q   8.4583  ...      0    male      0      0.0
6           6   E46        S  51.8625  ...      0    male      0      0.0
7           7   NaN        S  21.0750  ...      1    male      3      0.0
8           8   NaN        S  11.1333  ...      2  female      0      1.0
9           9   NaN        C  30.0708  ...      0  female      1      1.0

[10 rows x 12 columns]

In [4]:
df['Age']

0       22.0
1       38.0
2       26.0
3       35.0
4       35.0
        ...
1304     NaN
1305    39.0
1306    38.5
1307     NaN
1308     NaN
Name: Age, Length: 1309, dtype: float64

In [5]:
df.Age

0       22.0
1       38.0
2       26.0
3       35.0
4       35.0
        ...
1304     NaN
1305    39.0
1306    38.5
1307     NaN
1308     NaN
Name: Age, Length: 1309, dtype: float64

In [6]:
df[['Name', 'Parch', 'Sex']]

                                                   Name  Parch     Sex
0                               Braund, Mr. Owen Harris      0    male
1     Cumings, Mrs. John Bradley (Florence Briggs Th...      0  female
2                                Heikkinen, Miss. Laina      0  female
3          Futrelle, Mrs. Jacques Heath (Lily May Peel)      0  female
4                              Allen, Mr. William Henry      0    male
...                                                 ...    ...     ...
1304                                 Spector, Mr. Woolf      0    male
1305                       Oliva y Ocana, Dona. Fermina      0  female
1306                       Saether, Mr. Simon Sivertsen      0    male
1307                                Ware, Mr. Frederick      0    male
1308                           Peter, Master. Michael J      1    male

[1309 rows x 3 columns]

In [7]:
df.iloc[0] # select first row

Unnamed: 0                          0
Cabin                             NaN
Embarked                            S
Fare                             7.25
Pclass                              3
Ticket                      A/5 21171
Age                                22
Name          Braund, Mr. Owen Harris
Parch                               0
Sex                              male
SibSp                               1
Survived                            0
Name: 0, dtype: object

In [8]:
# Select the first three rows using iloc:
df.iloc[[0,1,2]]

   Unnamed: 0 Cabin Embarked     Fare  ...  Parch     Sex  SibSp Survived
0           0   NaN        S   7.2500  ...      0    male      1      0.0
1           1   C85        C  71.2833  ...      0  female      1      1.0
2           2   NaN        S   7.9250  ...      0  female      0      1.0

[3 rows x 12 columns]

In [9]:
columns = df.columns # Extract the list of columns
print(columns)

Index(['Unnamed: 0', 'Cabin', 'Embarked', 'Fare', 'Pclass', 'Ticket', 'Age',
       'Name', 'Parch', 'Sex', 'SibSp', 'Survived'],
      dtype='object')

In [10]:
df[columns[1:4]] # Columns 2, 3, 4

     Cabin Embarked      Fare
0      NaN        S    7.2500
1      C85        C   71.2833
2      NaN        S    7.9250
3     C123        S   53.1000
4      NaN        S    8.0500
...    ...      ...       ...
1304   NaN        S    8.0500
1305  C105        C  108.9000
1306   NaN        S    7.2500
1307   NaN        S    8.0500
1308   NaN        C   22.3583

[1309 rows x 3 columns]

In [11]:
# the value for the Fare column in row 2 using the row-centric method:
df.iloc[2]['Fare'] # Row centric

7.925

In [12]:
df.iloc[2].Fare # Row centric

7.925

In [13]:
df['Fare'][2] # Column centric

7.925

In [14]:
df.Fare[2] # Column centric

7.925